<?php

// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
//日志自动清理（V5.1.6+）
//
//从V5.1.6+版本开始，文件类型的日志支持自动清理。可以设置max_files参数，超过数量的最早日志将会自动删除。
//
//例如，下面设置日志最多保存数量为30个

return [
    // 日志记录方式，内置 file socket 支持扩展
    'type' => 'File',
    // 日志保存目录
    'path' => '',
    // 日志记录级别
    'level' => [],
    // 单文件日志写入
    'single' => false,
    // 独立日志级别
    'apart_level' => [],
    // 最大日志文件数量
    'max_files' => 30,
];
